using Telegram.Bot;
using Telegram.Bot.Types.ReplyMarkups;
using Telegram.Bot.Types;
using Telegram.Bot.Args;

public static class Rules
{
    public static async Task Start(ITelegramBotClient botClient, long chatId, CancellationToken cancellationToken)
    {
        string response = "Тут ты можаш прачытаць усе правілы";

        var inlineKeyboard = new InlineKeyboardMarkup(new[]
        {
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне словаў з вялікай літары", "rule1") },
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне словаў разам", "rule2") },
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне “да, з, што, на, па, усё, за, у, як, без”", "rule3") },
            new[] { InlineKeyboardButton.WithCallbackData("Канструкцыя “[ ]: [ ].”", "rule4") },
            new[] { InlineKeyboardButton.WithCallbackData("Пунктуацыя", "rule5") },
            new[] { InlineKeyboardButton.WithCallbackData("Класіфікацыя гукаў беларускай мовы", "rule6") },
            new[] { InlineKeyboardButton.WithCallbackData("Арфаграфія", "rule7") },
            new[] { InlineKeyboardButton.WithCallbackData("Часціны мовы", "rule8") },
            new[] { InlineKeyboardButton.WithCallbackData("Фразеалагізмы", "rule9") }
        });

        await botClient.SendTextMessageAsync(chatId, response, replyMarkup: inlineKeyboard);
    }

    public static async void HandleCallbackQuery(TelegramBotClient botClient, CallbackQuery callbackQuery)
    {
        string messageText = string.Empty;
        InlineKeyboardMarkup replyMarkup = null;

        switch (callbackQuery.Data)
        {
            case "rule1":
                messageText = @"У беларускай мове з вялікай літары пішуцца наступныя словы:
1. Першае слова ў сказе.
2. Першае слова пасля двукроп’я.
3. Усе словы ў назвах дзяржаўных і нацыянальных, ваенных і культурных рэліквій.
4. Усе словы ў поўных назвах ордэнаў, медалёў.
5. Аднаслоўныя ўласныя назвы і першае слова ў састаўных назвах кніг, газет, часопісаў, устаноў, арганізацый, заводаў, караблёў, марак машын.
6. Усе словы ў назвах дзяржаўных органаў і арганізацый.";
                replyMarkup = new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules"));
                break;

            //ruls2

            case "rule2":
                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    @"Правілы для напісання словаў разам у беларускай мове могуць быць наступнымі: 
1. Словазлучэнні з прыназоўнікамі: Звычайна словы пішуцца разам з іх прыназоўнікамі, калі яны ўтвараюць адзін канструктыў, адносіны ці агульную з'яву (напрыклад, кнігазборчы, птушкападобны). 
2. Словазлучэнні з дзеяслоўнікамі: Пішуцца разам словы, якія змяшчаюць дзеяслоў і іншыя часціны мовы, калі яны выяўляюць аднолькавы працэс, дзеянне або стан (напрыклад, па-суседску, уздоўждарожны). 
3. Утварэнні ад канструктыўных словазлучэнняў: Словы, якія ўтвораныя ад словазлучэнняў або выразаў, пішуцца разам, калі яны маюць аднолькавую з'яву (напрыклад, калі-нібудзь, дзень за днём). 
4. Утварэнні ад прыметнікаў: Словы, якія ўтвораныя ад прыметнікаў і іншых часцін мовы, пішуцца разам, калі яны апісваюць адзін аб'ект, якасць ці стан (напрыклад, маладушны, жоўтасць). 
5. Складаныя выразы: Пішуцца разам словы, якія складаюцца з некалькі частак і маюць аднокавую з'яву ці ўтвараюць адзін лагічны блок (напрыклад, дзяржаўна-праўны, пяцігадовы).",
                    replyMarkup: new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules")));
                break;

            //ruls3

            case "rule3":
                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    @"Словы “да, з, што, на, па, усё, за, у, як, без” могуць быць напісаныя разам у беларускай мове ў наступных выпадках:
1. Прыстаўкі: Гэтыя словы могуць быць напісаныя разам з іншымі словамі, калі яны выступаюць у ролі прыстаўкі. Напрыклад, “падаць”, “забыць”, “навучыць”, “пазнаёміцца”, “захаваць”, “увайсці”, “як-небудзь”, ""бездумны"".
2. Складаныя словы: Гэтыя словы могуць быць напісаныя разам у складаных словах. Напрыклад, “поўдзень”, “заўтра”, “навыгляд”, “поўгода”, “усёцела”, “заўсёды”, “усёдзень”, “якраз”, ""бездакорны"".
3. Словазлучэнні: Гэтыя словы могуць быць напісаныя разам у словазлучэннях. Напрыклад, “даўжыня”, “сшытак”, “навысотах”, “паўдарогі”, “усётакі”, “заўтрашні”, “усёдзённы”, “яктолькі”, ""бездакорны"".",
                    replyMarkup: new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules")));
                break;

            //ruls4

            case "rule4":
                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    @"У беларускай мове канструкцыя “[ ]: [ ].” выкарыстоўваецца ў наступных выпадках:
1. Двукроп’е ставіцца перад непасрэднім цытаваннем, а таксама перад пералічэннем.
2. Квадратныя дужківыкарыстоўваюцца для ўстаўкі дадатковай інфармацыі, якая не з’яўляецца часткай асноўнага тэксту, але якая можа быць карыснай для чытача.",
                    replyMarkup: new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules")));
                break;

            //ruls5

            case "rule5":
                var punctuationKeyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Усе кратка аб пунктуацыі", "rule5_sub1") },
        new[] { InlineKeyboardButton.WithCallbackData("Коска", "rule5_sub2") },
        new[] { InlineKeyboardButton.WithCallbackData("Працяжнік", "rule5_sub3") },
        new[] { InlineKeyboardButton.WithCallbackData("Апостраф", "rule5_sub4") },
        new[] { InlineKeyboardButton.WithCallbackData("Злучок", "rule5_sub5") },
        new[] { InlineKeyboardButton.WithCallbackData("Пунктуацыя ў складаназалежных сказах", "rule5_sub6") },
        new[] { InlineKeyboardButton.WithCallbackData("Пунктуацыя ў складаназлучаных сказах", "rule5_sub7") },
        new[] { InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    "Пунктуацыя",
                    replyMarkup: punctuationKeyboard);
                break;

            case "rule5_sub1":
                string R1Message = @"Пунктуацыя ў беларускай мове вельмі важная для правільнай пастаноўкі інтанацый і зразумеласці сказаў. Вось некаторыя агульныя правілы пунктуацыі:
1. Кропка ставіцца на канцы сказаў, якія выказваюць закончаную думку.
2. Пытальнік ставіцца на канцы пытальных сказаў.
3. Знак выкліку ставіцца на канцы сказаў, якія выказваюць эмоцыі, наказы, прызывы.
4. Коска выкарыстоўваецца для абазначэння аднародных членаў сказа, а таксама для выдзялення частак сказа, якія маюць асобны сінтаксічны статус.
5. Двукроп’е ставіцца перад непасрэднім цытаваннем, а таксама перад пералікамі.
6. Працяжнік выкарыстоўваецца для выдзялення частак сказа, якія маюць асобны сінтаксічны статус, а таксама для абазначэння пропускаў у тэксце.";

                var R1Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R1Message, replyMarkup: R1Keyboard);
                break;

            case "rule5_sub2":
                string R2Message = @"У беларускай мове коска ставіцца ў наступных выпадках:
1. Паміж адносна незалежнымі састаўнымі часткамі сказа, якія аб’ядноўваюцца ў адзін складаны сказ без злучнікаў, а самі часткі разгорнутыя і (або) маюць свае знакі прыпынку.
2. Паміж часткамі складанага сказа, якія звязваюцца паміж сабой далучальнымі злучнікамі але, толькі, аднак, усё ж, тым не менш і інш., асабліва калі гэтыя часткі разгорнутыя і (або) маюць свае знакі прыпынку.
3. Перад злучнікам а кропка з коскай ставіцца толькі ў тым выпадку, калі састаўныя часткі, якія звязваюцца гэтым злучнікам, разгорнутыя і маюць свае знакі прыпынку.
4. Паміж развітымі аднароднымі членамі, калі пры адным з іх ёсць коскі.
5. Паміж разгорнутымі даданымі часткамі складаназалежнага сказа, падпарадкаванымі адной і той жа галоўнай, калі паміж даданымі няма злучальнага злучніка, асабліва калі ў сярэдзіне такіх даданых ёсць свае даданыя часткі.
6. Паміж групамі адносна незалежных састаўных частак бяззлучнікавага сказа, а таксама паміж групамі даданых частак, якія адносяцца да адной галоўнай.
7. У канцы рубрык пералічэння, калі яны не з’яўляюцца самастойнымі сказамі, але дастаткова разгорнутыя і (або) маюць свае знакі прыпынку.
";

                var R2Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R2Message, replyMarkup: R2Keyboard);
                break;

            case "rule5_sub3":
                string R3Message = @"Працяжнік у беларускай мове ставіцца на месцы пропуску ў наступных выпадках:

1. Дзейнік і выказнік выражаны назоўнікамі ў назоўным склоне: ""Юравічы – паселішча вельмі старажытнае"".

2. Дзейнік і выказнік выражаны колькаснымі лічэбнікамі ў Н. с. ці адзін з іх выражаны назоўнікам, а другі – лічэбнікам у Н. с.: ""Плошча поля – два гектары"".

3. Абодва галоўныя члены ці адзін з іх выражаны інфінітывам (неазначальнай формай дзеяслова): ""Жыць – Радзіме служыць"".

4. Выказнік выражаны ўстойлівым спалучэннем слоў (фразеалагізмам): ""Нівы – вокам не абняць"".

5. Перад выказнікам стаяць словы гэта, вось, значыць, гэта значыць: ""Плошча поля – гэта наша радзіма, наш дом"".";

                var R3Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R3Message, replyMarkup: R3Keyboard);
                break;

            case "rule5_sub4":
                string R4Message = @"Апостраф у беларускай мове пішацца ў наступных выпадках:
1. Пры асобным вымаўленні зычных з наступным галосным: е, ё, ю, я і націскным і.
2. У сярэдзіне слова пасля  б, в, м, п, ф,  г, к, х,  д, т і  р перад літарамі е, ё, і, ю, я.
3. У складаных словах з першай часткай двух-, трох-, чатырох-, шмат- перад літарамі е, ё, ю, я.

Апостраф не пішацца:
1.Пасля ў (у нескладовага) перад літарамі е, ё, і, ю, я: абаўецца, саўюць, салаў.
";

                var R4Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R4Message, replyMarkup: R4Keyboard);
                break;



            case "rule5_sub5":
                string R5Message = @"Праз злучок пішуцца: 

1) прыслоўі па-першае, па-другое, па-трэцяе і г. д.; 
2) прыслоўі з прыстаўкай па-, утвораныя ад давальнага склону поўных прыметнікаў і прыналежных займеннікаў з суфіксамі -аму, -яму, -ому, -му: па-зімоваму, па-мойму; прыслоўі на -ску, -цку ад ад- носных прыметнікаў: па-таварыску, па-брацку; прыслоўі з суфіксам -ы ад прыметнікаў: па-дзіцячы, па-мядзведжы; 
3) складаныя прыслоўі, утвораныя паўтарэннем аднолькавых, блізкіх або супрацьлеглых па значэнні слоў (можа далучацца прыстаўка): светла-светла, крыж-накрыж, сюды-туды, як-ніяк, больш-менш; 
4) прыслоўі з прыстаўкай абы- і постфіксамі -небудзь, -колечы: абы-дзе, дзе-небудзь, як-колечы; 
5) тэхнічны тэрмін на-гара, Некаторыя прыслоўі з прыстаўкамі падобны на спалучэнні назоўнікаў, займеннікаў і лічэбнікаў з прыназоўнікамі: звярнуў убок — звярнуў у бок лесу, зрабілі ўтрох — у трох кнігах. 

Для размежавання такіх напісанняў неабходна ведаць наступныя правілы: 

1) назоўнікі з прыназоўнікамі абазначаюць прадмет і маюць пры сабе паясняльныя словы: упаў з верху (чаго?) дрэва; 
2) лічэбнікі і займеннікі дапасуюцца да назоўнікаў: прыехалі ў дзвюх машынах; прыслоўі прымыкаюць да дзеясловаў: прыйшлі ўдзвюх.";

                var R5Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R5Message, replyMarkup: R5Keyboard);
                break;

            case "rule5_sub6":
                string R6Message = @"У складаназалежных сказах у беларускай мове пунктуацыя вельмі важная. 

Вось некаторыя агульныя правілы:
1. Між часткамі складаназалежнага сказа ставіцца коска, калі ў другой частцы сказа заключаецца значэнне выніку, наступства, рэзкага супрацьпастаўлення, асабліва перад злучнікам ""і"".
2. Між аднасна незалежнымі састаўнымі часткамі сказа, якія аб’ядноўваюцца ў адзін складаны сказ без злучнікаў, а самі часткі разгорнутыя і (або) маюць свае знакі прыпынку.
3. Між часткамі складанага сказа, якія звязваюцца паміж сабой далучальнымі злучнікамі але, толькі, аднак, усё ж, тым не менш і інш., асабліва, калі гэтыя часткі разгорнутыя і (або) маюць свае знакі прыпынку.
4. Перад злучнікам “а” кропка з коскай ставіцца толькі ў тым выпадку, калі састаўныя часткі, якія звязваюцца гэтым злучнікам, разгорнутыя і маюць свае знакі прыпынку.
5. Між развітымі аднароднымі членамі, калі пры адным з іх ёсць коскі.
6. Між разгорнутымі даданымі часткамі складаназалежнага сказа, падпарадкаванымі адной і той жа галоўнай, калі паміж даданымі няма злучальнага злучніка, асабліва, калі ў сярэдзіне такіх даданых ёсць свае даданыя часткі.
7. Між групамі адносна незалежных састаўных частак бяззлучнікавага сказа, а таксама паміж групамі даданых частак, якія адносяцца да адной галоўнай.
8. У канцы рубрык пералічэння, калі яны не з’яўляюцца самастойнымі сказамі, але дастаткова разгорнутыя і (або) маюць свае знакі прыпынку.
";

                var R6Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R6Message, replyMarkup: R6Keyboard);
                break;


            case "rule5_sub7":
                string R7Message = @"У складаназлучаных сказах у беларускай мове пунктуацыя вельмі важная. 

Вось некаторыя агульныя правілы:
1. Між часткамі складаназлучанага сказа ставіцца коска, калі ў другой частцы сказа заключаецца значэнне выніку, наступства, рэзкага супрацьпастаўлення, асабліва перад злучнікам ""і"".
2. Між аднасна незалежнымі састаўнымі часткамі сказа, якія аб’ядноўваюцца ў адзін складаны сказ без злучнікаў, а самі часткі разгорнутыя і (або) маюць свае знакі прыпынку.
3. Між часткамі складанага сказа, якія звязваюцца паміж сабой далучальнымі злучнікамі але, толькі, аднак, усё ж, тым не менш і інш., асабліва, калі гэтыя часткі разгорнутыя і (або) маюць свае знакі прыпынку.
4. Перад злучнікам “а” кропка з коскай ставіцца толькі ў тым выпадку, калі састаўныя часткі, якія звязваюцца гэтым злучнікам, разгорнутыя і маюць свае знакі прыпынку.
5. Між развітымі аднароднымі членамі, калі пры адным з іх ёсць коскі.
6. Між разгорнутымі даданымі часткамі складаназалежнага сказа, падпарадкаванымі адной і той жа галоўнай, калі паміж даданымі няма злучальнага злучніка, асабліва калі ў сярэдзіне такіх даданых ёсць свае даданыя часткі.
7. Між групамі адносна незалежных састаўных частак бяззлучнікавага сказа, а таксама паміж групамі даданых частак, якія адносяцца да адной галоўнай.
8. У канцы рубрык пералічэння, калі яны не з’яўляюцца самастойнымі сказамі, але дастаткова разгорнутыя і (або) маюць свае знакі прыпынку.
";

                var R7Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule5") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R7Message, replyMarkup: R7Keyboard);
                break;


            //ruls6

            case "rule6":
                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    @"Усе гукі беларускай мовы падзяляюцца на галосныя і зычныя. 
Галосных гукаў 6 — [а], [о], [i], [у], [ы], [э]. 

Зычныя гукi складаюцца з шуму або з голасу i шуму і падраздзяляюцца па розных параметрах: 
1) паводле ўдзелу голасу i шуму; 2) паводле цвёрдасцi i мяккасцi; 
3) паводле спосабу ўтварэння; 
4) паводле месца ўтварэння.Шумныя зычныя з’яўляюцца суадноснымi па глухасцi-звонкасцi. 

Не маюць адпаведных звонкiх гукi [ф], [ф’].

Санорныя гукi ў параўнаннi з шумнымi маюць наступныя асаблiвасцi: 
а) не маюць адпаведных глухiх, г. зн. не ствараюць пар па глухасцi i звонкасцi; 
б) не асiмiлююцца па глухасцi перад глухiмi i не аглушаюцца ў канцы слова: водар [водар]; пыл [пыл]; гонкi [гонк’i]; 
в) самi санорныя не ўплываюць на вымаўленне папярэднiх глухiх — г. зн., што глухiя перад санорнымi не азванчаюцца: свой [свой]; учарашнi [учарашн’i]. Паводле цвёрдасцi i мяккасцi гукi падзяляюцца на цвёрдыя i мяккiя. 

Гукi [ж], [ш], [ч], [дж], [р], [ц] (не ўтвораны з [т]) называюцца зацвярдзелымi. 
Яны таксама не маюць адпаведных мяккiх.

Не мае пары i гук [дз] у запазычаных словах тыпу ксяндзы, пэндзаль. 

Санорныя гукi не змяняюцца пад уплывам iншых, г. зн. нi адна пазiцыя не з’яўляецца для iх слабай. 

Для шумных цвёрдых зычных моцная пазiцыя — перад галоснымi i санорнымi: [дом], [том], [хром], [хл’эў]; для звонкiх слабая пазiцыя — на канцы слова і перад глухiмi зычнымi: грыб [грып], казка [каска], а для глухiх — перад звонкiмi: касьба [каз’ба], футбол [фудбол]. 

Для глухiх (цвёрдых i мяккiх) моцнай з’яўляецца пазiцыя на канцы слова: лес [л’эс], спяваць [с’п’авац’]. 

Для свiсцячых [з], [с] слабай будзе пазiцыя перад мяккiмi зычнымi, за выключэннем заднеязычных [г’], [г’], [к’], [х’]: спяваць [с’п’авац’], з’есцi [з’йэс’ц’i]; але: згiнуць [зг’інуц’], мазгі [мазг’і]. 

!У абсалютным канцы слова адбываецца не асiмiляцыя, а аглушэнне: грыб — гры[п]. 
Асiмiляцыя па звонкасцi — вымаўленне глухога перад звонкiм як звонкага: футбол — фу[д]бол, носьбiт — но[з’]бiт. 
Асiмiляцыя па мяккасцi — прыпадабненне свiсцячых [з], [с] да наступных мяккiх, за выключэннем [г’], [г’], [к’], [х’]: свет — [с’]вет, знiкнуць — [з’]нiкнуць. 

Назiраецца ў маўленнi i прыпадабненне шыпячых да свiсцячых (на талерачцы — на талера[ц]цы) i свiсцячых да шыпячых (зжаць — [ж]жаць, сшыць — [ш]шыць).",
                    replyMarkup: new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules")));
                break;

            //ruls7

            case "rule7":
                var spellingKeyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Правапіс галосных О, Э — А, Ы ў простых словах", "rule7_sub1") },
        new[] { InlineKeyboardButton.WithCallbackData("Правапіс галосных Е, Ё — Я ў простых словах", "rule7_sub2") },
        new[] { InlineKeyboardButton.WithCallbackData("Правапіс галосных Е, Ё — Я  ў складаных словах", "rule7_sub3") },
        new[] { InlineKeyboardButton.WithCallbackData("Правапіс літар У і Ў", "rule7_sub4") },
        new[] { InlineKeyboardButton.WithCallbackData("Правапіс часціцы не / ні ", "rule7_sub5") },
        new[] { InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    "Арфаграфія",
                    replyMarkup: spellingKeyboard);
                break;

            case "rule7_sub1":
                string R8Message = @"Літара о пішацца толькі пад націскам

Не пад націскам о захоўваецца: 
• у выклічніках і часціцах
• у першай частцы некаторых іншамоўных тэрмінаў

Літара а пішацца на месцы о не пад націскам:
 • у пачатку і ў сярэдзіне агульных і ўласных назоўнікаў (гэта пазіцыйнае чаргаванне, у выніку якога ўзнікае аканне, што перадаецца на пісьме)
• у пачатку і ў сярэдзіне ўласных імён і геаграфічных назваў незалежна ад паходжання
• у якасці канчатка зменных слоў

Пад націскам літара э пішацца: 
• пасля шыпячых, [р], [д], [т] і цвёрдага [ц]• у словах з прыстаўным [г]
• у пачатку выклічнікаў: эй, эх, эт; 
• у пачатку іншамоўных слоў (у адпаведнасці з вымаўленнем)

Не пад націскам э захоўваецца: 
• у пачатку выклічнікаў
• у словах, утвораных ад слова сэнс
• у пачатку іншамоўных слоў

Літара а пішацца на месцы э не пад націскам:
• у спрадвечнабеларускіх словах і запазычаннях са славянскіх моў, у тым ліку і ва ўласных імёнах• у даўніх запазычаннях з неславянскіх моў, цалкам адаптаваных у беларускай мове
";

                var R8Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да арфаграфіі", "rule7") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R8Message, replyMarkup: R8Keyboard);
                break;

            case "rule7_sub2":
                string R9Message = @"Літара ё ў беларускай мове пішацца толькі пад націскам: цёплы, лёгкі, вёска, далёка, дэталёвы, сёлета; але: радыё. 

Літара е пішацца:
 • пад націскам (у адпаведнасці з вымаўленнем)• ва ўсіх складах, акрамя першага перад націскам
• у першым складзе перад націскам у словах, запазычаных з неславянскіх моў• у ненаціскных складах пасля [г’], [к’], [х’] 
• у часціцы не і прыназоўніку без незалежна ад вымаўлення

Пры напісанні са словамі разам часціца не і прыназоўнік без становяцца прыстаўкамі і падпарадкоўваюцца агульным правілам напісання е і я пры перадачы якання

Літара я замест ё, е пішацца: 
• у першым складзе перад націскам ва ўласнабеларускіх словах
• у першым складзе перад націскам у даўно запазычаных словах

Пачатковая літара я незалежна ад націску захоўваецца ва ўласных назвах і ў корані слова

Літара я ў няпершым пераднаціскным складзе пішацца толькі тады, калі ў аднакаранёвых словах пад націскам ёсць этымалагічны гук [а]

Літара я ў паслянаціскных складах пішацца: 
• у суфіксах назоўнікаў -яч, -язь, -ядзь: дзеяч, дробязь, боязь, роўнядзь, Бесядзь; але: споведзь, запаведзь; 
• у суфіксах дзеясловаў (лаяць, веяць, сеяць, муляць, кашляць, баяць), а таксама ў аддзеяслоўных назоўніках з суфіксамі -ялк- (сеялка, веялка) і -янк- (лаянка).

 Літара я традыцыйна пішацца ў некаторых паслянаціскных складах у корані (выцягнуць, вывязаць), суфіксах (месяц, памяць, пояс, тысяча, заяц, дзевяць, дзесяць, Прыпяць) і ў канчатках (песняй, хваляў, раннія, сённяшняга, трэцяму).
";

                var R9Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да арфаграфіі", "rule7") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R9Message, replyMarkup: R9Keyboard);
                break;

            case "rule7_sub3":
                string R10Message = @"Злучальныя галосныя е і я пішуцца пасля асноў на мяккі зычны, прычым галосная я — толькі тады, калі націск прыпадае на першы склад другой часткі складанага слова: жыццелюбівы, жыццярадасны.

 Злучальная галосная е ў складаных словах захоўваецца, калі другая частка пачынаецца з ў перад націскным складам: землеўлаHснік. 

Літара е ў першай частцы складанага слова захоўваецца незалежна ад месца націску ў другой частцы

Калі першай часткай складанага слова з’яўляецца аснова велік-/вялік-, напісанне літар е або я ў гэтай аснове залежыць ад месца націску ў другой частцы: літара е пішацца, калі націск падае на першы склад другой часткі. 

! Літара я ў першай частцы вяліка- захоўваецца ў складаных словах, другая частка якіх пачынаецца з ў перад націскным складам: вялікаўзроставы.

 Літара ё ў першай частцы складаных слоў захоўваецца пры націску не на першым складзе другой часткі складанага слова: мёдаварэHнне, цёмнавалоHсы; пры націску на першым складзе другой часткі ў першай частцы пішацца літара е: медазбоHр, цемнаскуHры. 

Літара ё ў першай частцы складанага слова захоўваецца, калі першы націскны склад другой часткі пачынаецца з ў перад націскным складам: лёгкаўзброены. 

Складанаскарочаныя словы разглядаюцца як простыя словы з адным націскам: лясгас, сяльмаг.
";

                var R10Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да арфаграфіі", "rule7") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R10Message, replyMarkup: R10Keyboard);
                break;


            case "rule7_sub4":
                string R11Message = @"Літара у пішацца: 
• у сярэдзіне і на канцы слоў пасля цвёрдых і зацвярдзелых зычных
• у пачатку слова, калі гэтым словам пачынаецца сказ
• у пачатку слова, калі папярэдняе слова заканчваецца на зычны ці мяккі знак або пасля знака прыпынку
• у пачатку ўласных назваў
• пад націскам у пачатку і ў сярэдзіне слова
• у канцы запазычаных слоў не пад націскам• у запазычаных словах, якія заканчваюцца на -ум, -ус: акварыум, соцыум, радыус, страус (і вытворных ад іх). 

Літара ў пішацца згодна з беларускім літаратурным вымаўленнем пасля галосных пры пэўных чаргаваннях гукаў. 

Пры чаргаванні [у] з [ў]: 
• у пачатку слова (калі гэта слова не пачынае сказ і перад ім няма знакаў прыпынку) 
• у сярэдзіне слова пасля галосных перад зычныміПры чаргаванні [л] з [ў]: 
• у сярэдзіне слоў перад зычнымі• у канцы слоў пасля галосных

Пры чаргаванні [в] з [ў]: 
• у сярэдзіне слоў перад зычнымі або літарамі е, ё, ю, я, і
• у канцы слоў: братаў, сватоў, востраў, свякроў. 

! Нескладовае ў пішацца пасля злучка або двукосся (гэтыя значкі не з’яўляюцца знакамі прыпынку), калі папярэдняе слова заканчваецца на галосны: кантрольна-ўліковы, жанчына-ўрач, па-ўчарашняму, гучнае «ўра», часопіс «Бярозка» ўзнавіў некаторыя рубрыкі.
";

                var R11Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да арфаграфіі", "rule7") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R11Message, replyMarkup: R11Keyboard);
                break;



            case "rule7_sub5":
                string R12Message = @"Як часціца не, так і часціца ні могуць выражаць і адмоўнае, і сцвярджальнае значэнне — гэта залежыць ад пэўных выпадкаў ужывання. 

Часціца не адносіцца да адмоўных. 
Яе асноўнае значэнне — адмаўленне таго, што выражана словам, з якім яна ўжыта: Жыццё не можа надакучыць (Ф. Баторын). Не чутно салаўя, не ўскрыкваюць совы (Н. Маеўская). 

Сцвярджальнай часціца не становіцца ў наступных выпадках: 

1) калі яна ўжыта двойчы — пры кожнай частцы састаўнога выказніка: не мог не пайсці, не мог не выканаць; 

2) у спалучэннях хто не, дзе не, дзе толькі не, куды не і інш., калі яны ўжываюцца ў незалежных пытальна- клічных сказах: 
Чаго толькі не ведаў мой дзед! (С. Лобач); 

3) калі стаіць перад назоўнікам з прыназоўнікам без: зірнуў не без цікавасці, зрабіў не без карысці; 

4) калі стаіць пасля часціц ледзь, чуць, амаль або пасля злучніка пакуль: ледзь не спазніліся, пакуль не позна; 

5) у спалучэнні са словамі нельга, немагчыма: нельга не паверыць, немагчыма не прыйсці; 

6) у спалучэннях не больш за, не меньш за. 


Часціца ні — узмацняльная. 

Яе роля — узмацняць або адмаўленне, або сцвярджэнне. 

Часціца ні ўзмацняе адмаўленне, ужо выражанае ў сказе іншымі сродкамі: 

1) у адмоўных сказах, дзе адмаўленне выражана часціцай не або словамі нельга, няма, немагчыма: 
Няма ні душы на вуліцы; у спалучэннях тыпу ні на момант, ні на хвіліну; 

2) у няпоўных сказах, у якіх выказнік з адмоўем падразумяваецца: 
Ні гуку ў адказ; 

3) у ролі злучніка і ў адмоўных сказах пры пералічэнні аднародных членаў сказа: 
Ні дождж, ні жар для яго [каменя] не страшны (Я. Колас); 

4) у пабуджальных сказах загаднага характару: 
Ні з месца! 

Часціца ні ўзмацняе сцвярджэнне ў даданых сказах, дзе выкарыстоўваецца ў спалучэнні з займеннікамі і прыслоўямі: дзе ні, хто ні, што ні, куды ні, адкуль ні і інш. 

У такія спалучэнні можа ўваходзіць часціца б (дзе б ні, хто б ні і г. д.): Толькі дзе за морам ні жыў я, Беларусь мая снілася мне (Г. Бураўкін). 

Часціца ні ўжываецца ў фразеалагізмах са значэннем няпэўнасці: ні тое ні сёе, ні рыба ні мяса і інш. Неабходна адрозніваць спалучэнні не раз (многа разоў) і ні разу (ні аднаго разу); не адзін (некалькі) і ні адзін (ніхто).";

                var R12Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да арфаграфіі", "rule7") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R12Message, replyMarkup: R12Keyboard);
                break;



            //ruls8

            case "rule8":
                var PartsOfSpeechKeyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назоўнік", "Noun") },
        new[] { InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    "Часціны мовы",
                    replyMarkup: PartsOfSpeechKeyboard);
                break;

            case "Noun":
                var NounSubMenuKeyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назоўнік - ...", "rule8_sub1") },
        new[] { InlineKeyboardButton.WithCallbackData("Род назоўнікаў", "rule8_sub2") },
        new[] { InlineKeyboardButton.WithCallbackData("Лік назоўнікаў", "rule8_sub3") },
        new[] { InlineKeyboardButton.WithCallbackData("Назоўнікі першага скланення. Правапіс", "rule8_sub4") },
        new[] { InlineKeyboardButton.WithCallbackData("Назад да пунктуацыі", "rule8") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, "выберы частку мовы", replyMarkup: NounSubMenuKeyboard);
                break;

            case "rule8_sub1":
                string R13Message = @"Назоўнік — самастойная часціна мовы, якая характарызуецца значэннем прадметнасці: стол, сшытак, з’ява, настаўнік, прыяцель. 

Назоўнікі адказваюць на пытанні хто? што?

 У залежнасці ад лексічнага значэння назоўнікі прынята падзяляць на агульныя і ўласныя, адушаўлёныя і неадушаўлёныя, канкрэтныя і абстрактныя, а таксама вылучаць сярод іх зборныя і рэчыўныя.

 Пры гэтым падзеле ўлічваецца не толькі лексічнае значэнне, але і граматычныя асаблівасці, якімі адна катэгорыя адрозніваецца ад другой. 

Так, мы гаворым, што катэгорыі роду, ліку і склону з’яўляюцца агульнымі для ўсіх назоўнікаў, аднак трэба мець на ўвазе, што канкрэтныя назоўнікі, напрыклад, змяняюцца па ліках (кніга — кнігі, лыжка — лыжкі), а абстрактныя, як правіла, ужываюцца або ў адзіночным ліку (радасць, сум), або ў множным (паводзіны, выбары).

";

                var R13Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да часціны мовы", "rule8") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R13Message, replyMarkup: R13Keyboard);
                break;

            case "rule8_sub2":
                string R14Message = @"Род нескланяльных назоўнікаў 

Пры вызначэнні роду нескланяльных назоўнікаў іншамоўнага паходжання, за выключэннем геаграфічных назваў, пад увагу бярэцца іх лексічнае значэнне: 
1) да мужчынскага роду адносяцца назвы асоб мужчынскага полу (аташэ, канферансье, маэстра, дэндзі) і назвы жывых істот (кенгуру, калібры, поні); выключэнні
2) да жаночага роду належаць назоўнікі, якія абазначаюць асоб жаночага полу 
3) да ніякага роду адносяцца назоўнікі, якія абазначаюць неадушаўлёныя прадметы

Асноўным паказчыкам роду нескланяльнай геаграфічнай назвы з’яўляецца агульны назоўнік, які можна падставіць да геаграфічнай назвы 

Род складанаскарочаных слоў (абрэвіятур) 

Граматычны род складанаскарочаных слоў (абрэвіятур) можа вызначацца па структуры скарачэння або па сэнсе. 

Па структуры скарачэння да мужчынскага роду адносяцца: 
• абрэвіятуры, якія складаюцца з пачатковых частак слоў і заканчваюцца на зычны
• гукавыя абрэвіятуры, падобныя на агульныя назоўнікі мужчынскага роду; калі пішуцца вялікімі літарамі, іх род можа супадаць з родам апорнага кампанента, а можа не супадаць

Правілы вызначэння роду абрэвіятур па сэнсе наступныя: 
• род нескланяльных абрэвіятур літарнага тыпу, якія пішуцца вялікімі літарамі, вызначаецца, як правіла, па родзе апорнага слова• калі абрэвіятура ўтворана шляхам спалучэння часткі аднаго назоўніка і формы роднага склону другога назоўніка, то абрэвіятура адносіцца да таго роду, да якога належыць слова, ад якога ўтворана першая частка абрэвіятуры

Род складаных назоўнікаў 
1. Род складаных назоўнікаў, якія называюць асобу па прафесіі, званні, сацыяльным паходжанні і пад., вызначаецца па назоўніку, які ўказвае на прыналежнасць асобы да пэўнага полу (жанчына-кандуктар (ж.), цуда-асілак (м.)). 
2. У складаных назоўніках, якія называюць неадушаўлёныя прадметы, асноўную сэнсавую нагрузку нясе найчасцей першае слова, таму па ім вызначаецца род усяго складанага слова
3. Род складаных назоўнікаў, якія абазначаюць жывых істот, вызначаецца па першым кампаненце
4. Род складаных назоўнікаў, якія называюць неадушаўлёныя прадметы і ў якіх змяняецца толькі адна частка, вызначаецца па змяняльным кампаненц

";

                var R14Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да часціны мовы", "rule8") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R14Message, replyMarkup: R14Keyboard);
                break;

            case "rule8_sub3":
                string R15Message = @"У залежнасці ад формаў ліку назоўнікі падзяляюцца на дзве групы: 
1) назоўнікі, якія маюць суадносныя формы адзіночнага і множнага ліку; 
2) назоўнікі, якія ўжываюцца толькі ў адзіночным або толькі ў множным ліку. 

Суадносныя паводле значэння формы адзіночнага і множнага ліку маюць назоўнікі з прадметным значэннем — яны абазначаюць прадметы і з’явы рэчаіснасці, што паддаюцца лічэнню і могуць спалучацца з колькаснымі лічэбнікамі! Не маюць формаў ліку нескланяльныя назоўнікі з канкрэтным значэннем: кафэ — тры кафэ, паліто — тры паліто. 

Толькі ў адзіночным ліку ўжываюцца адзіночналікавыя назоўнікі, да якіх адносяцца: 
1) назоўнікі са зборным значэннем: радня, лісце, моладзь, птаства; 
2) назоўнікі з рэчыўным значэннем: малако, жалеза, сок, снег; 
3) абстрактныя назоўнікі, якія абазначаюць якасці, уласцівасці, прыметы, працэсы, псіхічны стан і інш.
4) назоўнікі, якія абазначаюць грамадска-палітычныя плыні, вучэнні, формы дзяржаўнага ладу, вытвор- чыя працэсы, мерапрыемствы, галіны навукі: феадалізм, дэмакратызацыя, рэалізм, індустрыялізацыя, яравізацыя, мовазнаўства; 
5) назоўнікі, якія абазначаюць напрамкі свету (поўнач, поўдзень, захад, усход), астранамічныя і геаграфічныя аб’екты (Марс, Зямля, Беларусь, Полаччына); 
6) уласныя імёны (Iван, Каваленка, БДУ). 

Толькі ў множным ліку ўжываюцца назоўнікі з адпаведнай назвай — множналікавыя. 
Да іх адносяцца: 
1) назоўнікі, якія абазначаюць парныя і састаўныя прадметы: вароты, сенцы, акуляры, вілы, соты; 

!Гэтыя назоўнікі могуць спалучацца са зборнымі лічэбнікамі: двое варот, абцугоў. 

2) назоўнікі, якія абазначаюць сукупнасць прадметаў ці з’яў у іх адзінстве: ападкі, прыпасы, зараслі, грошы; 
3) назоўнікі, якія абазначаюць сукупнасць асоб або пэўныя грамадскія пласты: бацькі, кадры, нізы; 
4) назоўнікі, якія паходзяць ад прыметнікаў і абазначаюць віды раслін і жывёл або віды розных выплат
5) некаторыя рэчыўныя назоўнікі: дровы, лекі, прысмакі, выскваркі; 
6) рытуалы, працэсы, стан: памінкі, паводзіны, замаразкі, зносіны, хітрыкі; 
7) гульні, абрады, звычаі, святы: хованкі, вячоркі, дажынкі, дзяды; 
8) прамежкі часу і прасторавыя паняцці: суткі, будні, канікулы, гоні; 
9) некаторыя геаграфічныя і астранамічныя назвы: Баранавічы, Асіповічы, Гімалаі, Філіпіны, сузор’е Блізняты.
";

                var R15Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да часціны мовы", "rule8") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R15Message, replyMarkup: R15Keyboard);
                break;


            case "rule8_sub4":
                string R16Message = @"Склонавыя канчаткі залежаць ад характару асновы і месца націску ў слове. 

Асновы назоўнікаў першага скланення могуць заканчвацца: — на цвёрды зычны: вясн-а; — на мяккі зычны: зямл-я; — на зацвярдзелы зычны (ж, дж, ш, ч, р, ц): мяж-а, душ-а, мар-а; — на г, к, х: наг-а, рак-а, страх-а. 

Аснова можа змяняцца ў выніку чаргавання галосных і зычных: рука — у руцэ, вішня — вішань, страха — на страсе. 

Неабходна ведаць спецыфічныя для беларускай мовы канчаткі: 
• у назоўнікаў з асновай на цвёрды зычны ў творным склоне пад націскам канчатак -ой (-ою), не пад націскам — -ай (-аю): сасной (сасною), бярозай (бярозаю); у давальным і месным склонах канцавы цвёрды зычны асновы чаргуецца з адпаведным мяккім: сасна — на сасне, чарада — у чарадзе, аплата —пры аплаце; 
• у назоўнікаў з асновай на мяккі зычны ў давальным і месным склонах канчатак -і: хваля — на хвалі, станцыя — на станцыі; у творным (у залежнасці ад націску) — -ёй (-ёю), -яй (-яю): зямлёй (зямлёю), хваляй (хваляю); 
• назоўнікам з асновай на зацвярдзелы ў родным, давальным і месным склонах уласцівы канчатак -ы: мяжа — на мяжы, вуліца — на вуліцы; 
• у назоўніках з асновай на г, х у давальным і месным склонах заднеязычныя [г], [х] чаргуюцца са свісцячымі [з’], [с’]: дарога — на дарозе, страха — на страсе; у творным склоне канчатак залежыць ад націску: дарогай (дарогаю), страхой (страхою). 

У назоўнікаў з асновай на к у давальным і месным склонах пад націскам канчатак -э, не пад націскам — -ы, пры гэтым заднеязычны [к] чаргуецца са свісцячым [ц]: дачкаH — дачцэH, рукаH — у руцэH; але: руHчка — на руHчцы.
";

                var R16Keyboard = new InlineKeyboardMarkup(new[]
                {
        new[] { InlineKeyboardButton.WithCallbackData("Назад да часціны мовы", "rule8") }
    });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, R16Message, replyMarkup: R16Keyboard);
                break;


            //ruls 9


            case "rule9":
                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id,
                    @"Фразеалагізм  — устойлівае спалучэнне слоў з адзіным цэласным значэннем: ні слыху ні дыху — ‘ніякіх звестак’, рукой падаць — ‘зусім блізка’, душа ў душу — ‘дружна’.

Фразеалагізмы — гэта гатовыя моўныя адзінкі, вядомыя носьбітам мовы. 
Асобныя словы ў іх складзе страчваюць сваё лексічнае значэнне і не могуць з’яўляцца асобным членам сказа.
Нягледзячы на тое, што фразеалагізмы могуць мець граматычную структуру словазлучэння (даць маху, кляваць носам, на ўсё горла) або цэлага сказа (свет клінам сышоўся, віламі па вадзе пісана, куды ногі нясуць), у сказе яны выконваюць ролю аднаго члена сказа.
У сказе Лёгкага хлеба не бывае фразеалагізм лёгкага хлеба выконвае ролю дапаўнення.",
                    replyMarkup: new InlineKeyboardMarkup(InlineKeyboardButton.WithCallbackData("да правіл👉🏻", "/rules")));
                break;


            //klv

            case "/rules":
                string rulesMessage = "Тут ты можаш прачытаць усе правілы";
                var rulesKeyboard = new InlineKeyboardMarkup(new[]
                {
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне словаў з вялікай літары", "rule1") },
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне словаў разам", "rule2") },
            new[] { InlineKeyboardButton.WithCallbackData("Напісанне “да, з, што, на, па, усё, за, у, як, без”", "rule3") },
            new[] { InlineKeyboardButton.WithCallbackData("Канструкцыя “[ ]: [ ].”", "rule4") },
            new[] { InlineKeyboardButton.WithCallbackData("Пунктуацыя", "rule5") },
            new[] { InlineKeyboardButton.WithCallbackData("Класіфікацыя гукаў беларускай мовы", "rule6") },
            new[] { InlineKeyboardButton.WithCallbackData("Арфаграфія", "rule7") },
            new[] { InlineKeyboardButton.WithCallbackData("Часціны мовы", "rule8") },
            new[] { InlineKeyboardButton.WithCallbackData("Фразеалагізмы", "rule9") }
        });

                await botClient.SendTextMessageAsync(callbackQuery.Message.Chat.Id, rulesMessage, replyMarkup: rulesKeyboard);
                break;
        }
    }
}